const unique = require('../index');
const chai = require('chai');

describe("Тест функции unique", () => {
    it("Вход: [1, 1, 2, 2, 3, 3, 4, 5, 6, 7, 7, 7, 8, 9, 7, 8, 8, 1, 2, 3, 4, 5, 6, 7, 0]," +
        "Выход: [1, 2, 3, 4, 5, 6, 7, 8, 9, 0]", () => {
        chai
            .expect(unique([1, 1, 2, 2, 3, 3, 4, 5, 6, 7, 7, 7, 8, 9, 7, 8, 8, 1, 2, 3, 4, 5, 6, 7, 0]))
            .deep.to.equal([1, 2, 3, 4, 5, 6, 7, 8, 9, 0]);
    });

    it("Вход: [-1, 0, 1, -1, 0, 1], Выход:[-1, 0, 1]", () => {
        chai.expect(unique([-1, 0, 1, -1, 0, 1])).deep.to.equal([-1, 0, 1]);
    });
})