const assert = require('assert');

module.exports = (testFunc) => {
    describe("Сотни", () => {
        it('Должен быть 100000000000', () => {
            assert.equal(testFunc(100000000000), "100000000000");
        });

        it('Должен быть 100000000000 + 1', () => {
            assert.equal(testFunc(100000000001), "100000000000+1");
        });

        it('Должен быть 100000 + 2000 + 30', () => {
            assert.equal(testFunc(102030), "100000+2000+30");
        });

        it('Должен быть 10000 + 2000 + 300 + 40', () => {
            assert.equal(testFunc(12340), "10000+2000+300+40");
        });

        it('Должен быть 100000 + 2000 + 30', () => {
            assert.equal(testFunc(102345), "100000+2000+300+40+5");
        });
    });
}